content/posts/chandra2020.md
+++
title = "chandra2020 | Resolved-Acceleration Control of Serial Robotic Manipulators Using Unit Dual Quaternions"
author = ["João Gutemberg Farias"]
draft = false
+++

The authors propose a new controller using [Resolved-Acceleration Control]({{< relref "resolved_acceleration_control" >}}) (looks like a [feedback linearization]({{< relref "feedback_linearization" >}})) for the trajectory tracking of serial robotic manipulators using dual quaternions and based on screw theory.
The controller is compared to a uncoupled controller (which separates translation and orientation) getting similar results, actually performed worse on position but better on orientation.

Cita bastante <sup id="33cbc6f7bc59ab3b6dddeb95d9d74a7c"><a href="#ozgur2016" title="\Ozg\ur \&amp; Mezouar, Kinematic Modeling and Control of a Robot Arm Using Unit Dual Quaternions, {Robotics and Autonomous Systems}, v(), 66--73 (2016).">ozgur2016</a></sup> e também três trabalhos de Featherstone que seriam importantes de se ler pois embasam o uso de vetores em 6d e uma separação entre acelaração convencional e aceleração espacial (a espacial seria a derivada da velocidade dual)


## Info {#info}


## Notes {#notes}


### Resumo {#resumo}

The authors propose a new controller using [Resolved-Acceleration Control]({{< relref "resolved_acceleration_control" >}}) (looks like a [feedback linearization]({{< relref "feedback_linearization" >}})) for the trajectory tracking of serial robotic manipulators using dual quaternions and based on screw theory.
The controller is compared to a uncoupled controller (which separates translation and orientation) getting similar results, actually performed worse on position but better on orientation.

Cita bastante <sup id="33cbc6f7bc59ab3b6dddeb95d9d74a7c"><a href="#ozgur2016" title="\Ozg\ur \&amp; Mezouar, Kinematic Modeling and Control of a Robot Arm Using Unit Dual Quaternions, {Robotics and Autonomous Systems}, v(), 66--73 (2016).">ozgur2016</a></sup> e também três trabalhos de Featherstone que seriam importantes de se ler pois embasam o uso de vetores em 6d e uma separação entre acelaração convencional e aceleração espacial (a espacial seria a derivada da velocidade dual)

[Task Space]({{< relref "task_space" >}}) [Joint Space]({{< relref "joint_space" >}})
